artillery.yml
# *****Index Test******

# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 20
# scenarios:
#   - flow:
#       - get:
#           url: "/users"


# *****Logout Test*****

# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 20
# scenarios:
#   - flow:
#       - post:
#           url: "/users"
#           json:
#             name: "Test"
#             email: "test@example.com"
#             password: "Password123"  
#           capture:
#             - json: $.token
#               as: "token"
#       - post:
#           url: "/users/login"
#           headers:
#             Authorization: "Bearer {{token}}"
#           json:
#             email: "test@example.com"
#             password: "Password123"
#       - post:
#           url: "/users/logout"
#           headers:
#             Authorization: "Bearer {{token}}"
#           json:
#             email: "test@example.com"
#             password: "Password123"             


# *****Login Test*****

config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            name: "Test"
            email: "test@example.com"
            password: "Password123"  
          capture:
            - json: $.token
              as: "token"
      - post:
          url: "/users/login"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            email: "test@example.com"
            password: "Password123"     


# *****Delete Test*****

# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 20
# scenarios:
#   - flow:
#       - post:
#           url: "/users"
#           json:
#             name: "Test"
#             email: "test@example.com"
#             password: "Password123"  
#           capture:
#             - json: $.token
#               as: "token"
#             - json: $.user._id
#               as: "userId" 
#       - delete:
#           url: "/users/{{userId}}"
#           headers:
#             Authorization: "Bearer {{token}}"            


# *****Update Test*****

# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 20
# before:
#     flow:
#       - log: "Get auth token"
#       - post:
#           url: "/users"
#           json:
#             name: "Test"
#             email: "test@example.com"
#             password: "Password123"  
#           capture:
#             - json: $.token
#               as: "token"
#             - json: $.user._id
#               as: "userId"     
# scenarios:
#   - flow:
#       - put:
#           url: "/users/{{userId}}"
#           headers:
#             Authorization: "Bearer {{token}}"
#           json:
#             name: "Test 3"
#             email: "test@example.com"
#             password: "Password123"